## Data Model Descriptions

In [2]:
import pandas as pd 
import numpy as np 

#import Disaster Data 1900 - 2021
pd_dm = pd.read_csv('C:\\Users\\msbar\\Data Engineering Final Project\\data\\Data Model Information - Sheet1.csv')
pd_dm.shape

(40, 7)

In [3]:
pd_dm.head()

,Table Name,Column Name,Original data source column,Data Type,Constraint,Example,Source
0,surfacetemp,year,dt,int,NOT NULL,NaN,NaN
1,surfacetemp,month,dt,int,NaN,NaN,NaN
2,surfacetemp,avg_temperature,AverageTemperature,FLOAT,NaN,NaN,NaN
3,surfacetemp,avg_temperature_uncertainty,AverageTemperatureUncertainty,FLOAT,NaN,NaN,NaN
4,surfacetemp,country,Country,varchar,NOT NULL,NaN,NaN

In [6]:
# Find what portion of our data is each data type
pd_dm['Data Type'].value_counts()

varchar          19
FLOAT            12
int               7
varchar(5000)     2
Name: Data Type, dtype: int64

In [10]:
#List variables with constraints
pd_dm[pd_dm['Constraint'].isna() == 0]

,Table Name,Column Name,Original data source column,Data Type,Constraint,Example,Source
0,surfacetemp,year,dt,int,NOT NULL,NaN,NaN
4,surfacetemp,country,Country,varchar,NOT NULL,NaN,NaN
5,population,country,Country Name,varchar,NOT NULL,NaN,NaN
6,population,year,Year,int,NOT NULL,NaN,NaN
12,naturaldisaster_info,year,year,varchar,NOT NULL,NaN,NaN
13,naturaldisaster_info,country,country,varchar,NOT NULL,NaN,NaN
27,naturaldisaster_damage,year,year,int,NOT NULL,NaN,NaN
28,naturaldisaster_damage,country,country,varchar,NOT NULL,NaN,NaN